In [51]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [52]:
import webbrowser
link = 'https://www.tiobe.com/tiobe-index/'
webbrowser.open(link)

True

In [65]:
df = pd.read_clipboard()

In [66]:
df

   Jul 2018 Jul 2017  Change Programming Language  Ratings Change.1
0         1        1     NaN                 Java  16.139%   +2.37%
1         2        2     NaN                    C  14.662%   +7.34%
2         3        3     NaN                  C++   7.615%   +2.04%
3         4        4     NaN               Python   6.361%   +2.82%
4         5        7  change    Visual Basic .NET   4.247%   +1.20%
5         6        5  change                   C#   3.795%   +0.28%
6         7        6  change                  PHP   2.832%   -0.26%
7         8        8     NaN           JavaScript   2.831%   +0.22%
8         9        -  change                  SQL   2.334%   +2.33%
9        10       18  change          Objective-C   1.453%   -0.44%

In [55]:
type(df)

pandas.core.frame.DataFrame

In [56]:
df.columns

Index(['Jul', '2018', 'Jul.1', '2017', 'Change', 'Programming', 'Language',
       'Ratings', 'Change.1'],
      dtype='object')

In [67]:
df.Ratings

0    16.139%
1    14.662%
2     7.615%
3     6.361%
4     4.247%
5     3.795%
6     2.832%
7     2.831%
8     2.334%
9     1.453%
Name: Ratings, dtype: object

In [68]:
df['Ratings']

0    16.139%
1    14.662%
2     7.615%
3     6.361%
4     4.247%
5     3.795%
6     2.832%
7     2.831%
8     2.334%
9     1.453%
Name: Ratings, dtype: object

In [69]:
df_new = DataFrame(df,columns=['Programming Language','Jul 2018'])

In [70]:
df_new

  Programming Language  Jul 2018
0                 Java         1
1                    C         2
2                  C++         3
3               Python         4
4    Visual Basic .NET         5
5                   C#         6
6                  PHP         7
7           JavaScript         8
8                  SQL         9
9          Objective-C        10

In [61]:
type(df['Ratings'])

pandas.core.series.Series

In [71]:
df_new = DataFrame(df,columns=['Programming Language','Jul 2018','Jul 2019'])
df_new

  Programming Language  Jul 2018  Jul 2019
0                 Java         1       NaN
1                    C         2       NaN
2                  C++         3       NaN
3               Python         4       NaN
4    Visual Basic .NET         5       NaN
5                   C#         6       NaN
6                  PHP         7       NaN
7           JavaScript         8       NaN
8                  SQL         9       NaN
9          Objective-C        10       NaN

In [72]:
df_new['Jul 2019']=range(0,10)

In [73]:
df_new

  Programming Language  Jul 2018  Jul 2019
0                 Java         1         0
1                    C         2         1
2                  C++         3         2
3               Python         4         3
4    Visual Basic .NET         5         4
5                   C#         6         5
6                  PHP         7         6
7           JavaScript         8         7
8                  SQL         9         8
9          Objective-C        10         9

In [76]:
df_new['Jul 2019'] = pd.Series(np.arange(1,22))
df_new

  Programming Language  Jul 2018  Jul 2019
0                 Java         1         1
1                    C         2         2
2                  C++         3         3
3               Python         4         4
4    Visual Basic .NET         5         5
5                   C#         6         6
6                  PHP         7         7
7           JavaScript         8         8
8                  SQL         9         9
9          Objective-C        10        10

In [77]:
len(df_new)

10

In [81]:
df_new['Jul 2019'] = pd.Series([100,200],index=[6,7])
df_new

  Programming Language  Jul 2018  Jul 2019
0                 Java         1       NaN
1                    C         2       NaN
2                  C++         3       NaN
3               Python         4       NaN
4    Visual Basic .NET         5       NaN
5                   C#         6       NaN
6                  PHP         7     100.0
7           JavaScript         8     200.0
8                  SQL         9       NaN
9          Objective-C        10       NaN